src/Documents/ВходящееИзвещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Document>
		<Properties>
			<Name>ВходящееИзвещение</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектронногоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектронногоОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийЗапросКаталога</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийКаталогТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящаяЭлектроннаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийРеджектАкцептСчетаФактуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийАкцептСчетаФактуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийРеджектАкцептЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийАкцептНакладной</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийЗапросПрайсЛиста</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийРеджектАкцептНакладной</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийСчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящаяЭлектроннаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийКаталогТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийРеджектЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийПрайсЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийЗапросКаталога</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийАкцептЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийТоварКРаботе</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийТоварКРаботе</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийРеджектСчетаФактуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийСчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийРеджектНакладной</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийПрайсЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийЗапросПрайсЛиста</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Comment>Любая дополнительная информация</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ВходящееИзвещение/Ext/ObjectModule.bsl
Функция ЗагрузитьЭлементХМЛ(ОбъектXML, ИмяУзла, Параметры) Экспорт
	
	Перем СтрокаТовара;
	
	Параметры.Свойство("СтрокаТовара", СтрокаТовара);
	
	Если ИмяУзла = "Извещение" Тогда
		
		Обработан = Истина;
		
	ИначеЕсли ИмяУзла = "НомерИсходногоДокумента" Тогда
		
		ИсходныйДокумент = ЭлектронныеДокументы.ПолучитьСсылкуНаДокументПоДаннымИзXML(ОбъектXML, Неопределено, Параметры);
		
	ИначеЕсли ИмяУзла = "СтатусОбработкиДокумента" Тогда
		
		СтатусОбработки = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);		
		
	ИначеЕсли ИмяУзла = "СтатусОбработкиТовара" Тогда			
		
		СтрокаТовара = Товары.Добавить();
		Параметры.Вставить("СтрокаТовара", СтрокаТовара);
		
	ИначеЕсли   ИмяУзла = "ИдТовара" Тогда
		ЭлектронныеДокументы.ЗаполнитьНоменклатуруИХарактеристикуПоИдентификатору(СтрокаТовара, ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML), Параметры);
		
	ИначеЕсли ИмяУзла = "Примечание" Тогда
		
		СтрокаТовара.Примечание = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);			
	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СуществуетИсходящийДокумент(СсылкаНаОтветныйДокумент = Неопределено) Экспорт
  	
	Возврат Ложь;
	
КонецФункции // ()
